/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_strchr.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: dhawkgir <dhawkgir@student.21-school.ru    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2021/10/13 15:11:00 by dhawkgir          #+#    #+#             */
/*   Updated: 2022/01/09 13:42:38 by dhawkgir         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

/*
Функция strchr ищет первое вхождения символа,
код которого указан в аргументе c, в строке,
на которую указывает аргумент s.
*/
#include "../includes/libft.h"

char	*ft_strchr(const char *s, int c)
{
	size_t	i;

	i = 0;
	if (!s)
		return (0);
	while (*(s + i) != (char)c && *(s + i))
		i++;
	if (*(s + i) == (char)c)
		return ((char *)s + i);
	else
		return (0);
}
